hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_spi.h
    @param[in] p_instance       Pointer to the driver instance structure.
    @param[in] p_tx_buffer      Pointer to the transmit buffer. Can be NULL
                               if there is nothing to send.
    @param     tx_buffer_length Length of the transmit buffer.
    @param[in] p_rx_buffer      Pointer to the receive buffer. Can be NULL
                               if there is nothing to receive.
    @param     rx_buffer_length Length of the receive buffer.

    @retval NRF_SUCCESS            If the operation was successful.
    @retval NRF_ERROR_BUSY         If a previously started transfer has not finished
                                  yet.
    @retval NRF_ERROR_INVALID_ADDR If the provided buffers are not placed in the Data
                                  RAM region.
*/
__STATIC_INLINE
ret_code_t nrf_drv_spi_transfer(nrf_drv_spi_t const *const p_instance,
                                uint8_t const *p_tx_buffer,
                                uint8_t         tx_buffer_length,
                                uint8_t        *p_rx_buffer,
                                uint8_t         rx_buffer_length);
                                
/**
    @brief Function for starting the SPI data transfer with additional option flags.

    Function enables customizing the transfer by using option flags.

    Additional options are provided using the flags parameter:

    - @ref NRF_DRV_SPI_FLAG_TX_POSTINC and @ref NRF_DRV_SPI_FLAG_RX_POSTINC<span></span>:
     Post-incrementation of buffer addresses. Supported only by SPIM.
    - @ref NRF_DRV_SPI_FLAG_HOLD_XFER<span></span>: Driver is not starting the transfer. Use this
     flag if the transfer is triggered externally by PPI. Supported only by SPIM. Use
     @ref nrf_drv_spi_start_task_get to get the address of the start task.
    - @ref NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER<span></span>: No user event handler after transfer
     completion. This also means no interrupt at the end of the transfer. Supported only by SPIM.
     If @ref NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER is used, the driver does not set the instance into
     busy state, so you must ensure that the next transfers are set up when SPIM is not active.
     @ref nrf_drv_spi_end_event_get function can be used to detect end of transfer. Option can be used
     together with @ref NRF_DRV_SPI_FLAG_REPEATED_XFER to prepare a sequence of SPI transfers
     without interruptions.
    - @ref NRF_DRV_SPI_FLAG_REPEATED_XFER<span></span>: Prepare for repeated transfers. You can set
     up a number of transfers that will be triggered externally (for example by PPI). An example is
     a TXRX transfer with the options @ref NRF_DRV_SPI_FLAG_RX_POSTINC,
     @ref NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER, and @ref NRF_DRV_SPI_FLAG_REPEATED_XFER. After the
     transfer is set up, a set of transfers can be triggered by PPI that will read, for example,
     the same register of an external component and put it into a RAM buffer without any interrupts.
     @ref nrf_drv_spi_end_event_get can be used to get the address of the END event, which can be
     used to count the number of transfers. If @ref NRF_DRV_SPI_FLAG_REPEATED_XFER is used,
     the driver does not set the instance into busy state, so you must ensure that the next
     transfers are set up when SPIM is not active. Supported only by SPIM.
    @note Function is intended to be used only in non-blocking mode.

    @param p_instance  Pointer to the driver instance structure.
    @param p_xfer_desc Pointer to the transfer descriptor.
    @param flags       Transfer options (0 for default settings).

    @retval NRF_SUCCESS             If the procedure was successful.
    @retval NRF_ERROR_BUSY          If the driver is not ready for a new transfer.
    @retval NRF_ERROR_NOT_SUPPORTED If the provided parameters are not supported.
    @retval NRF_ERROR_INVALID_ADDR  If the provided buffers are not placed in the Data
                                   RAM region.
*/
__STATIC_INLINE
ret_code_t nrf_drv_spi_xfer(nrf_drv_spi_t     const *const p_instance,
                            nrf_drv_spi_xfer_desc_t const *p_xfer_desc,
                            uint32_t                        flags);
                            
/**
    @brief Function for returning the address of a SPIM start task.

    This function should be used if @ref nrf_drv_spi_xfer was called with the flag @ref NRF_DRV_SPI_FLAG_HOLD_XFER.
    In that case, the transfer is not started by the driver, but it must be started externally by PPI.

    @param[in]  p_instance Pointer to the driver instance structure.

    @return     Start task address.
*/
__STATIC_INLINE
uint32_t nrf_drv_spi_start_task_get(nrf_drv_spi_t const *p_instance);

/**
    @brief Function for returning the address of a END SPIM event.

    A END event can be used to detect the end of a transfer if the @ref NRF_DRV_SPI_FLAG_NO_XFER_EVT_HANDLER
    option is used.

    @param[in]  p_instance Pointer to the driver instance structure.

    @return     END event address.
*/
__STATIC_INLINE
uint32_t nrf_drv_spi_end_event_get(nrf_drv_spi_t const *p_instance);

/**
    @brief Function for aborting ongoing transfer.

    @param[in]  p_instance Pointer to the driver instance structure.
*/
__STATIC_INLINE
void nrf_drv_spi_abort(nrf_drv_spi_t const *p_instance);


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

#if defined(SPI_PRESENT) && !defined(SPIM_PRESENT)
#define NRF_DRV_SPI_WITH_SPI
#elif !defined(SPI_PRESENT) && defined(SPIM_PRESENT)
#define NRF_DRV_SPI_WITH_SPIM
#else
#if (NRFX_CHECK(SPI0_ENABLED) &&  NRFX_CHECK(SPI0_USE_EASY_DMA)) || \
(NRFX_CHECK(SPI1_ENABLED) &&  NRFX_CHECK(SPI1_USE_EASY_DMA)) || \
(NRFX_CHECK(SPI2_ENABLED) &&  NRFX_CHECK(SPI2_USE_EASY_DMA))
#define NRF_DRV_SPI_WITH_SPIM
#endif
#if (NRFX_CHECK(SPI0_ENABLED) && !NRFX_CHECK(SPI0_USE_EASY_DMA)) || \
(NRFX_CHECK(SPI1_ENABLED) && !NRFX_CHECK(SPI1_USE_EASY_DMA)) || \
(NRFX_CHECK(SPI2_ENABLED) && !NRFX_CHECK(SPI2_USE_EASY_DMA))
#define NRF_DRV_SPI_WITH_SPI
#endif
#endif
#if defined(NRF_DRV_SPI_WITH_SPIM) && defined(NRF_DRV_SPI_WITH_SPI)
#define NRF_DRV_SPI_USE_SPIM  (p_instance->use_easy_dma)
#elif defined(NRF_DRV_SPI_WITH_SPIM)
#define NRF_DRV_SPI_USE_SPIM  true
#else
#define NRF_DRV_SPI_USE_SPIM  false
#endif
#define NRF_DRV_SPI_USE_SPI  (!NRF_DRV_SPI_USE_SPIM)

