hananddong/ble_uwb_code/UWB_BLE_nrf52832/integration/nrfx/legacy/nrf_drv_spi.h
__STATIC_INLINE
void nrf_drv_spi_uninit(nrf_drv_spi_t const *p_instance)
{
    if(NRF_DRV_SPI_USE_SPIM)
        nrfx_spim_uninit(&p_instance->u.spim);
        
    else if(NRF_DRV_SPI_USE_SPI)
        nrfx_spi_uninit(&p_instance->u.spi);
}

__STATIC_INLINE
ret_code_t nrf_drv_spi_transfer(nrf_drv_spi_t const *const p_instance,
                                uint8_t const *p_tx_buffer,
                                uint8_t         tx_buffer_length,
                                uint8_t        *p_rx_buffer,
                                uint8_t         rx_buffer_length)
{
    ret_code_t result = 0;
    
    if(NRF_DRV_SPI_USE_SPIM)
    {
        #ifdef SPIM_PRESENT
        nrfx_spim_xfer_desc_t const spim_xfer_desc =
        {
            .p_tx_buffer = p_tx_buffer,
            .tx_length   = tx_buffer_length,
            .p_rx_buffer = p_rx_buffer,
            .rx_length   = rx_buffer_length,
        };
        result = nrfx_spim_xfer(&p_instance->u.spim, &spim_xfer_desc, 0);
        #endif
    }
    
    else if(NRF_DRV_SPI_USE_SPI)
    {
        #ifdef SPI_PRESENT
        nrfx_spi_xfer_desc_t const spi_xfer_desc =
        {
            .p_tx_buffer = p_tx_buffer,
            .tx_length   = tx_buffer_length,
            .p_rx_buffer = p_rx_buffer,
            .rx_length   = rx_buffer_length,
        };
        result = nrfx_spi_xfer(&p_instance->u.spi, &spi_xfer_desc, 0);
        #endif
    }
    
    return result;
}

__STATIC_INLINE
ret_code_t nrf_drv_spi_xfer(nrf_drv_spi_t     const *const p_instance,
                            nrf_drv_spi_xfer_desc_t const *p_xfer_desc,
                            uint32_t                        flags)
{
    ret_code_t result = 0;
    
    if(NRF_DRV_SPI_USE_SPIM)
    {
        #ifdef SPIM_PRESENT
        nrfx_spim_xfer_desc_t const spim_xfer_desc =
        {
            .p_tx_buffer = p_xfer_desc->p_tx_buffer,
            .tx_length   = p_xfer_desc->tx_length,
            .p_rx_buffer = p_xfer_desc->p_rx_buffer,
            .rx_length   = p_xfer_desc->rx_length,
        };
        result = nrfx_spim_xfer(&p_instance->u.spim, &spim_xfer_desc, flags);
        #endif
    }
    
    else if(NRF_DRV_SPI_USE_SPI)
    {
        #ifdef SPI_PRESENT
        nrfx_spi_xfer_desc_t const spi_xfer_desc =
        {
            .p_tx_buffer = p_xfer_desc->p_tx_buffer,
            .tx_length   = p_xfer_desc->tx_length,
            .p_rx_buffer = p_xfer_desc->p_rx_buffer,
            .rx_length   = p_xfer_desc->rx_length,
        };
        result = nrfx_spi_xfer(&p_instance->u.spi, &spi_xfer_desc, flags);
        #endif
    }
    
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_spi_start_task_get(nrf_drv_spi_t const *p_instance)
{
    uint32_t result = 0;
    
    if(NRF_DRV_SPI_USE_SPIM)
        result = nrfx_spim_start_task_get(&p_instance->u.spim);
        
    else if(NRF_DRV_SPI_USE_SPI)
    {
        NRFX_ASSERT(false); // not supported
        result = 0;
    }
    
    return result;
}

__STATIC_INLINE
uint32_t nrf_drv_spi_end_event_get(nrf_drv_spi_t const *p_instance)
{
    uint32_t result = 0;
    
    if(NRF_DRV_SPI_USE_SPIM)
        result = nrfx_spim_end_event_get(&p_instance->u.spim);
        
    else if(NRF_DRV_SPI_USE_SPI)
    {
        NRFX_ASSERT(false); // not supported
        result = 0;
    }
    
    return result;
}

__STATIC_INLINE
void nrf_drv_spi_abort(nrf_drv_spi_t const *p_instance)
{
    if(NRF_DRV_SPI_USE_SPIM)
        nrfx_spim_abort(&p_instance->u.spim);
        
    else if(NRF_DRV_SPI_USE_SPI)
        nrfx_spi_abort(&p_instance->u.spi);
}

#endif // SUPPRESS_INLINE_IMPLEMENTATION

/** @} */

#ifdef __cplusplus
}
#endif

#endif // NRF_DRV_SPI_H__
